brew tap 'caskroom/cask'

# ZSH
# --------------------
brew 'zsh'
brew 'zsh-completions'


# DEV
# --------------------
brew 'git'
brew 'python3'
brew 'cocoapods'

# c && c++
# brew 'gcc'
# brew 'gdb'
# brew 'valgrind'


# Apps
# --------------------
# ↳ utils
    cask 'alfred'
    cask 'iterm2'
    cask 'sublime-text'
    # bartender2
# ↳ browsers
    cask 'firefox'
    cask 'google-chrome'
# ↳ cloud
    cask 'dropbox'
    cask 'google-drive'
# ↳ design
    cask 'sketch'
# ↳ social
    cask 'franz'


# Mac App Store
# --------------------
mas "1Password",    id: 443987910
mas "Xcode",        id: 497799835
mas "Quiver",       id: 866773894
mas "Discord",      id: 985746746


# School
# --------------------
# cask 'mendely-desktop'
