brew tap 'caskroom/cask'

# DEV
# --------------------
brew 'zsh'
brew 'zsh-completions'

brew 'git'
brew 'python3
brew 'cocoapods'

cask 'iterm2'
cask 'visual-studio-code'
# cask 'sublime-text'

# c && c++
# brew 'gcc'
# brew 'gdb'
# brew 'valgrind'


# Apps
# --------------------
# ↳ utils
    cask 'alfred'
    cask 'flux'
    cask 'karabiner'
    cask 'hyperswitch'
    # cask bartender3
# ↳ browsers
    cask 'firefox'
    cask 'google-chrome'
# ↳ cloud
    cask 'google-drive'
# ↳ design
    cask 'sketch'
# ↳ social


# Mac App Store
# --------------------
mas "1Password",    id: 443987910
mas "Xcode",        id: 497799835
mas "Quiver",       id: 866773894
mas "Amphetamine",  id: 937984704 
# mas "Discord",      id: 985746746


# School
# --------------------
# cask 'mendely-desktop'
